tutorials/OCMF/OCMF_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     centriMembSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat       ascii;
writeCompression on;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo 0.2;
maxDeltaT 0.1;

libs ("libGamaPatchAvgTimeWindow.so");


functions
{

    meanU
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        // escreve no log
        log             true;

        // quando escrever
        writeControl    timeStep;
        writeInterval   20;

        // OBRIGATÓRIO nesta versão
        writeFields     false;

        // região = todo o domínio
        regionType      all;

        // operação: média volumétrica (vector)
        operation       volAverage;

        fields
        (
            U
        );
    }


    GamaPatchAvgTimeWindow1
    {
        type        GamaPatchAvgTimeWindow;

        // --- settings ---
        patchName   membrane;
        fieldName   Gama;
        timeWindow  1;              // atenção: isto continua a ser 30 steps!

        // --- output control ---
        writeControl writeTime;      // segue o writeInterval do controlDict
        log         true;

        // optional naming
        outputName  Gama_membrane_avgWin;
        fileName    areaAvg_timeWindow.dat;
    }
}



// ************************************************************************* //
